In [17]:
from pandas import DataFrame
Data={'Name':['lisa','niya','muji'],
     'Age':[34,74,12],
     'Salary':[709,800,230]}

In [18]:
Data

{'Name': ['lisa', 'niya', 'muji'],
 'Age': [34, 74, 12],
 'Salary': [709, 800, 230]}

In [19]:
frame=DataFrame(Data)

In [20]:
frame

   Name  Age  Salary
0  lisa   34     709
1  niya   74     800
2  muji   12     230

In [21]:
new_frame=DataFrame(Data,columns=('Age','Name','Salary','Job'))

In [22]:
new_frame

   Age  Name  Salary  Job
0   34  lisa     709  NaN
1   74  niya     800  NaN
2   12  muji     230  NaN

In [23]:
new_frame['Name']

0    lisa
1    niya
2    muji
Name: Name, dtype: object

In [24]:
new_frame.loc[2]

Age         12
Name      muji
Salary     230
Job        NaN
Name: 2, dtype: object

In [25]:
new_frame.loc[0]

Age         34
Name      lisa
Salary     709
Job        NaN
Name: 0, dtype: object

In [30]:
new_frame['Job']='Doctor'

In [31]:
new_frame

   Age  Name  Salary     Job
0   34  lisa     709  Doctor
1   74  niya     800  Doctor
2   12  muji     230  Doctor

In [32]:
new_frame.T

             0       1       2
Age         34      74      12
Name      lisa    niya    muji
Salary     709     800     230
Job     Doctor  Doctor  Doctor

In [33]:
from pandas import Series
obj=Series([100,200,300,400,500],index=['a','b','c','e','d'])

In [34]:
obj

a    100
b    200
c    300
e    400
d    500
dtype: int64

In [35]:
obj=obj.reindex(['a','b','c','d','e'])

In [36]:
obj

a    100
b    200
c    300
d    500
e    400
dtype: int64

In [39]:
frame

   Name  Age  Salary
0  lisa   34     709
1  niya   74     800
2  muji   12     230

In [40]:
frame=frame.reindex([0,2,1])

In [41]:
frame

   Name  Age  Salary
0  lisa   34     709
2  muji   12     230
1  niya   74     800